app/controllers/equipment_controller.rb

SELECT * FROM `equipment`
---
  def index
    @equipment=Equipment.all

INSERT INTO `equipment` (`created_at`, `updated_at`, `description`) VALUES('2010-10-14 22:07:05', '2010-10-14 22:07:05', 'test')
---
  def new
    @equipment=Equipment.new(params[:equipment])

    if request.post? and @equipment.save

SELECT * FROM `equipment` WHERE (`equipment`.`id` = 14)
UPDATE `equipment` SET `updated_at` = '2010-10-14 22:13:08', `description` = 'tests' WHERE `id` = 14
---
  def edit
    @equipment=Equipment.find(params[:id])
    if request.post?
      @equipment.attributes=params[:equipment]
      if @equipment.save