app/controllers/equipment_controller.rb

  def destroy
    @equipment.destroy
---
DELETE FROM `equipment` WHERE (`id` IN (13))

  def load_equipment
    @equipment=Equipment.find(params[:id])
---
SELECT * FROM `equipment` WHERE (`equipment`.`id` = 13)