app/controllers/game_player_controller.rb

  def update_status
    @game=Game.find(params[:id])
    @player_statuses=PlayerStatus.find(:all, :conditions => "description NOT IN ('Maybe', 'No response')", :order => :description)

    if request.post?
      @game_player=GamePlayer.new(params[:game_player])
      player=Player.find_by_email_address(@game_player.email_address)
      if player.nil?
        @game_player.errors.add("Player not found by address")

        render :update_status
      else
        gp=GamePlayer.find_by_game_id_and_player_id(@game.id, player.id)
        gp.player_status_id=@game_player.player_status_id
        gp.save
---
SELECT * FROM `games` WHERE (`games`.`id` = 152)
SELECT * FROM `game_statuses` WHERE (`game_statuses`.`id` = 1)
SELECT * FROM `player_statuses` WHERE (description NOT IN ('Maybe', 'No response')) ORDER BY description
SELECT * FROM `players` WHERE (`players`.`email_address` = 'cwise@murmurinformatics.com') LIMIT 1
SELECT * FROM `game_players` WHERE (`game_players`.`player_id` = 55 AND `game_players`.`game_id` = 156) LIMIT 1
UPDATE `game_players` SET `updated_at` = '2010-10-15 12:12:19', `player_status_id` = 3 WHERE `id` = 4336