app/controllers/game_controller.rb

  def index
    @games=Game.paginate(:order => 'game_date desc', :page => params[:page])
---
SELECT * FROM `games` ORDER BY game_date desc LIMIT 0, 10
SELECT count(*) AS count_all FROM `games`

  def new
    @game=Game.new(params[:game])
    @game.game_status_id=1
    build_lists

    if request.post?
      params.each do |id, value|
        if(id.match(/^game_player/))
          @game.game_players.build(value)
        end
      end

      if @game.save
        flash[:notice] = 'Game add succeeded'
        redirect_to({:action => 'index'})

        # send notification
        @game.game_players.each do |gp|
          if(gp.player.has_email?)
            HockeyMailer.deliver_announce_game(@game, gp)
          end
        end
      else
        flash[:notice] = 'Game add failed'
        build_lists
        render :action => 'edit'
      end
    else
      #need to add the default players
      @players=Player.find(:all, :conditions => "active = 1")
---
INSERT INTO `game_players` (`game_id`, `player_id`, `player_status_id`, `equipment_id`, `created_at`, `updated_at`, `goalie`) VALUES(146, 55, 1, 5, '2010-04-06 17:33:26', '2010-04-06 17:33:26', 0)
INSERT INTO `games` (`game_date`, `message`, `created_at`, `updated_at`, `game_status_id`, `organizer`, `organizer_address`) VALUES('2010-04-06', 'This is just a test - ignore', '2010-04-06 17:33:26', '2010-04-06 17:33:26', 1, 'Chris ', 'chriswise@rogers.com')
SELECT * FROM `game_statuses` WHERE (description <> 'Send Update' )
SELECT * FROM `players` WHERE (active = 1)
SELECT * FROM `players` WHERE (`players`.`id` = 55)

  def edit
    @game=Game.find(params[:id])
    old_game_status_id=@game.game_status_id
    build_lists

    if request.post?
      @game.attributes=params[:game]
      @game.game_players.each do | gp |
        values=params["game_player_#{gp.player_id}"]
        gp.update_attributes(values)
---
SELECT * FROM `games` WHERE (`games`.`id` = 146)
SELECT * FROM `players` WHERE (`players`.`id` = 55)
SELECT `game_statuses`.id FROM `game_statuses` WHERE (description = 'Send Update') LIMIT 1
UPDATE `game_players` SET `player_status_id` = 3, `goalie` = 0, `updated_at` = '2010-07-29 13:27:12' WHERE `id` = 4331
UPDATE `games` SET `game_status_id` = 2, `message` = 'And another test of the game on message', `updated_at` = '2010-04-06 17:34:39' WHERE `id` = 146

  def delete
    @game=Game.find(params[:id])
    @game.delete
---
SELECT * FROM `games` WHERE (`games`.`id` = 151)
DELETE FROM `games` WHERE (`id` IN (151))

  def view
    @game=Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 146)