app/controllers/players_controller.rb

  def index
    @players=Player.order(:name).paginate :page => params[:page]
---
SELECT * FROM `players` ORDER BY name LIMIT 0, 10

  def load_player
    @player=Player.find(params[:id])
---
SELECT * FROM `players` WHERE (`players`.`id` = 55)