app/controllers/player_controller.rb

SELECT * FROM `players` ORDER BY name LIMIT 0, 10
SELECT count(*) AS count_all FROM `players`
---
  def index
    @players=Player.paginate :order => 'name', :page => params[:page]

SELECT * FROM `players` WHERE (email_address LIKE '%c%')
---
  def lookup
    @players=Player.find(:all, :conditions => ['email_address LIKE ?', "%#{params[:search]}%"])

INSERT INTO `players` (`name`, `email_address`, `created_at`, `updated_at`, `active`) VALUES('Chris Wise', 'cwise@murmurinformatics.com', '2010-04-06 17:23:00', '2010-04-06 17:23:00', 1)
---
  def new
    @player=Player.new(params[:player])

    if request.post? and @player.save

SELECT * FROM `players` WHERE (`players`.`id` = 56)
UPDATE `players` SET `active` = 0, `updated_at` = '2010-04-21 23:23:57' WHERE `id` = 56
---
  def edit
    @player=Player.find(params[:id])
    if request.post?
      @player.attributes=params[:player]
      if @player.save

SELECT * FROM `players` WHERE (`players`.`id` = 57)
DELETE FROM `players` WHERE (`id` IN (57))
---
  def delete
    @player=Player.find(params[:id])
    @player.delete

SELECT `played_games`.* FROM `played_games` WHERE (`played_games`.player_id IN (55,56))
SELECT * FROM `players`
---
  def player_summary
    @players=Player.find(:all, :include => [:played_games])
    @sorted_players=@players.to_a.sort { |a,b| b.times_played <=> a.times_played }

SELECT * FROM `players` WHERE (active = 1)
SELECT `played_games`.* FROM `played_games` WHERE (`played_games`.player_id IN (55,56,57))
SELECT * FROM `players`
---
  def goalies_on_deck
    @players=Player.find(:all, :conditions => 'active = 1', :include => [:played_games])
    @sorted_players=@players.to_a.sort do |a,b|